---
kind: method
id: M:Autodesk.Revit.DB.EditScope.Dispose
source: html/a42bd333-2276-0df4-2ecc-17f04671a840.htm
---
# Autodesk.Revit.DB.EditScope.Dispose Method

Releases all resources used by the EditScope

## Syntax (C#)
```csharp
public void Dispose()
```